Revit 2024 API
ModelPath.GetModelGUID Method
 A GUID identifying the Revit cloud model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public Guid GetModelGUID()
Visual Basic
Public Function GetModelGUID As Guid
Visual C++
public:
Guid GetModelGUID()
See Also
ModelPath Class
Autodesk.Revit.DB Namespace